app/Controllers/EngineerController.php

    public function add()
    {
        $model = new EngineerModel();

        // ✅ CHECK IF USER EXISTS
        $userId = 1; // Change to an existing user ID

        if (! $model->db->table('users')->where('id', $userId)->countAllResults()) {
            return "User ID does not exist. Create user first.";
        }

        $model->insert([
            'user_id'        => $userId,
            'phone'          => '9876543210',
            'specialization' => 'Hardware Specialist'
        ]);
---
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `id` = 1
INSERT INTO `engineers` (`user_id`, `phone`, `specialization`) VALUES (1, '9876543210', 'Hardware Specialist')