app/Controllers/ServiceController.php

    public function add()
    {
        $model = new ServiceModel();

        $data = [
            'ticket_id'    => 1, // MUST exist in tickets table
            'service_date' => date('Y-m-d'),
            'remarks'      => 'General repair completed'
        ];

        if ($model->insert($data)) {
---
INSERT INTO `services` (`ticket_id`, `service_date`, `remarks`) VALUES (1, '2026-01-14', 'General repair completed')