app/Controllers/TicketController.php

    public function add()
    {
        $model = new TicketModel();

        // ✅ USE EXISTING IDs ONLY
        $data = [
            'customer_id' => 1,   // MUST exist in customers table
            'device_id'   => 1,   // MUST exist in devices table
            'engineer_id' => 1,   // MUST exist in engineers table
            'issue'       => 'Internet not working',
            'status'      => 'Open'
        ];

        try {
            $model->insert($data);
---
INSERT INTO `tickets` (`customer_id`, `device_id`, `engineer_id`, `issue`, `status`) VALUES (1, 1, 1, 'Internet not working', 'Open')