app/Models/ActivityLogModel.php

INSERT INTO `activity_logs` (`user_id`, `activity`) VALUES (1, 'Test Activity Log')
---
    public function addLog($data)
    {
        return $this->insert($data);

SELECT *
FROM `activity_logs`
---
    public function getLogs()
    {
        return $this->findAll();