app/Models/CustomerModel.php

    public function addCustomer($data)
    {
        return $this->insert($data);
---
INSERT INTO `customers` (`phone`, `address`) VALUES ('1234567890', 'Some Address')