app/Models/DeviceModel.php

INSERT INTO `devices` (`customer_id`, `device_name`) VALUES (1, 'Laptop')
---
    public function addDevice($data)
    {
        return $this->insert($data);