app/Models/Rolemodel.php

    public function addRole($data)
    {
        return $this->insert($data);
---
INSERT INTO `roles` (`role_name`) VALUES ('Admin')