app/Models/UserModel.php

INSERT INTO `users` (`role_id`, `name`, `email`, `password`) VALUES (1, 'Test User', 'testuser@example.com', '$2y$10$EmTrkAXZFbIqXobaKW.QA.Fke1/84oXZaMJhZ7UPfdUO3Nbhfx.1y')
---
    public function createUser($data)
    {
        return $this->insert($data);